using System;
using System.Collections.Generic;
using System.Linq;
using System.Net;
using System.Windows;
using System.Windows.Controls;
using System.Windows.Documents;
using System.Windows.Input;
using System.Windows.Media;
using System.Windows.Media.Animation;
using System.Windows.Shapes;
using Microsoft.Phone.Controls;

namespace chotatsu
{
    public partial class MainPage : PhoneApplicationPage
    {
       static readonly string[] AccentColors = { "magenta", "purple", "teal", "lime", "brown", "pink", "orange", "blue", "red", "green" };
        // organization list
        static readonly string[] OrganList = { "なし", "内閣府", "公正取引委員会", "法務省", "独立行政法人", "JETRO",
			"沖縄科学技術研究基盤整備機構", "統計センター", "情報通信研究機構", "造幣局", "国立印刷局",
			"通関情報処理センター", "日本万国博覧会記念機構", "住宅金融支援以降", "国立特別支援教育総合研究所",
			"国立青少年教育振興機構", "理化学研究所", "宇宙航空研究開発機構", "日本スポーツ振興センター", "日本芸術文化振興会",
			"物質・材料研究機構", "防災科学技術研究所", "放射線医学総合研究所", "海洋研究開発機構", "国立高等専門学校機構",
			"日本原子力研究開発機構", "日本原子力研究開発機構 東海研究開発センター", "国立病院機構", "勤学者退職金共済機構",
			"高齢・障害者雇用支援機構", "労働政策研究・研修機構", "雇用・能力開発機構", "労働者健康福祉機構",
			"農林水産消費安全技術センター", "年金積立金管理運用", "種苗管理センター", "水産大学校",
			"農業・食品産業技術総合研究機構", "農産生物資源研究", "農業環境技術研究所", "国際農林水産業研究センター",
			"製品評価技術基盤機構", "工業所有権情報・研修館", "日本貿易保険", "産業技術総合研究所",
			"新エネルギー・産業技術総合研究所", "日本貿易振興機構", "原子力安全基盤機構", "石油天然ガス・金属鉄物資源機構",
			"中小企業基盤整備機構", "土木研究所", "建築研究所", "海上技術安全研究所", "湾岸空港技術研究所", "海技術育機構",
			"船海訓練所", "航空大学校", "鉄道建設・運輸施設整備支援機構", "水資源機構", "水産総合研究センター",
			"科学技術振興機構", "文部化学賞", "国立大学法人京都大学", "国立大学法人琉球大学", "国立天文台",
			"国立大学法人三重大学", "国立大学法人信州大学", "国立大学法人新潟大学", "大学共同利用機関法人",
			"国立大学法人東北大学", "独立行政法人国立高等専門学校機構", "国立大学法人福井大学", "国立大学法人北海道大学",
			"国立大学法人名古屋大学", "国立大学法人愛媛大学", "国立大学法人高知大学", "国立大学法人金沢大学",
			"国立大学法人長崎大学", "国立大学法人徳島大学", "国立大学法人奈良先端科学技術大学院大学",
			"大学共同利用機関法人高エネルギー加速器研究機構", "国立大学法人大阪大学", "国立大学法人東京海洋大学",
			"国立大学法人東京工業大学", "国立大学法人東京大学", "国立大学法人富山大学", "沖縄高額高等専門学校",
			"国立大学法人岐阜大学", "国立大学法人香川大学", "国立大学法人島根大学", "国立大学法人岡山大学",
			"国立大学法人佐賀大学", "国立大学法人静岡大学", "国立大学法人大阪教育大学", "国立大学法人筑波大学",
			"国立大学法人北見工業大学", "宮城教育大学", "国立大学法人茨城大学", "新潟大学", "岐阜大学", "名古屋工業大学",
			"京都大学", "国立大学法人山口大学", "豊田工業高等専門学校", "鈴鹿工業高等専門学校", "詫間電波工業専門学校",
			"国立情報学研究所", "大学共同利用機関法人人間文化研究機構国立歴史民俗博物館", "メディア教育開発センター", "静岡大学",
			"名古屋大学", "大阪教育大学", "広島大学", "岐阜工業高等専門学校", "津山工業高等専門学校", "大臣官房会計課",
			"厚生労働省", "官房会計課", "労働基準局労災補償部", "社会保険庁", "職業安定局雇用保険課長", "国立感染症研究所",
			"厚生労働省職業安定局", "厚生労働省老健局", "労働省職業能力開発局", "医薬食品局", "健康局", "農林水産省",
			"林野庁　森林整備部治山課", "林野庁", "水産庁", "大臣官房経理課", "技術会議事務局筑波事務所", "東北森林管理局",
			"総合食料局", "経済産業省", "国土交通省", "自動車交通局", "四国地方整備局", "北陸地方整備局",
			"中部地方整備局", "九州地方整備局", "中国地方整備局", "関東地方整備局", "航空局", "財務省", "理財局",
			"横浜税関総務部", "最高裁判所", "事務総局経理局", "広島高等裁判所事務局", "東京高等裁判所事務局",
			"最高裁判所事務総局経理局", "大阪高等裁判所事務局", "防衛省", "海上自衛隊", "陸上自衛隊", "防衛医科大学校",
			"外務省", "金融庁", "環境省", "総務省", "国立大学法人", "宮内庁", "国家公安委員会", "警察庁",
			"公害等調整委員会", "消防庁", "検察庁", "公安審査委員会", "公安調査庁", "国税庁", "文化庁",
			"中央労働委員会", "資源エネルギー庁", "特許庁", "中小企業庁", "運輸安全委員会", "観光庁", "気象庁",
			"海上保安庁", "内閣法制局", "人事院", "都道府県", "北海道", "青森県", "岩手県", "宮城県", "秋田県",
			"山形県", "福島県", "茨城県", "栃木県", "群馬県", "埼玉県", "千葉県", "東京都", "神奈川県",
			"新潟県", "富山県", "石川県", "福井県", "山梨県", "長野県", "岐阜県", "静岡県", "愛知県",
			"三重県", "滋賀県", "京都府", "大阪府", "兵庫県", "奈良県", "和歌山県", "鳥取県", "島根県",
			"岡山県", "広島県", "山口県", "徳島県", "香川県", "愛媛県", "高知県", "福岡県", "佐賀県",
			"長崎県", "熊本県", "大分県", "宮崎県", "鹿児島県", "沖縄県", "政令指定都市", "札幌市", "仙台市",
			"さいたま市", "千葉市", "横浜市", "川崎市", "新潟市", "静岡市", "浜松市", "名古屋市", "京都市",
			"大阪市", "堺市", "神戸市", "岡山市", "広島市", "北九州市", "福岡市", "中核市", "旭川市",
			"函館市", "青森市", "盛岡市", "秋田市", "郡山市", "いわき市", "宇都宮市", "前橋市", "川越市",
			"船橋市", "柏市", "横須賀市", "相模原市", "富山市", "金沢市", "長野市", "岐阜市", "豊田市",
			"豊橋市", "岡崎市", "大津市", "高槻市", "東大阪市", "姫路市", "西宮市", "尼崎市", "奈良市",
			"和歌山市", "倉敷市", "福山市", "下関市", "高松市", "松山市", "高知市", "久留米市", "長崎市",
			"熊本市", "大分市", "宮崎市", "鹿児島市" };


        // Constructor
        public MainPage()
        {
            InitializeComponent();
            DataContext = OrganList;
        }

        private void btnSearch_Click(object sender, RoutedEventArgs e)
        {
            if (this.txtKeyword.Text.Length == 0)
            {
                return;
            }


            string target = "/result.xaml";
            target += "?limit=50&q=" + this.txtKeyword.Text;

            if (this.org.SelectedIndex > 0)
                target += "&org=" + OrganList[this.org.SelectedIndex];
            if (datePicker.SelectedIndex == 1)
                target += "&end=" + datePar.ValueString;




            this.NavigationService.Navigate(new Uri(target, UriKind.Relative));

        }

        private void TextBox_LostFocus(object sender, RoutedEventArgs e)
        {
            if (txtKeyword.Text.Length > 0)
            {
                labHint.Text = "";
            }
            else
            {
                labHint.Text = "キーワード";
            }

        }


        private void btnHelp_Click(object sender, RoutedEventArgs e)
        {
            string target = "/help.xaml";
            this.NavigationService.Navigate(new Uri(target, UriKind.Relative));
        }
    }
}