using System;
using System.Collections.Generic;
using System.Linq;
using System.Net;
using System.Windows;
using System.Windows.Controls;
using System.Windows.Documents;
using System.Windows.Input;
using System.Windows.Media;
using System.Windows.Media.Animation;
using System.Windows.Shapes;
using Microsoft.Phone.Controls;

namespace kosoku
{
    public partial class MainPage : PhoneApplicationPage
    {

        string[] arr = { "軽自動車等", "普通車", "中型車", "大型車", "特大車" };
        List<string> ICs = new List<string>();
        public Boolean canDrop = true;
        // Constructor
        public MainPage()
        {
            InitializeComponent();



            //string ICsString = "Fernando Sucre,Scofield,Alexander Mahone,Theodore Bagwell,Sara Tancredi ,Lincoln Burrows,John Abruzzi,Fluorine";
            string[] icNames = { "浦和", "岩槻", "久喜", "加須", "羽生", "館林", "佐野藤岡",
			"佐野ＳＡスマート", "栃木", "鹿沼", "宇都宮", "上河内ＳＡスマート", "矢板", "西那須野塩原", "黒磯板室",
			"那須", "那須高原ＳＡスマート", "白河", "白河中央スマート", "矢吹", "鏡石ＰＡスマート", "須賀川",
			"郡山南", "郡山（東北道）", "本宮", "二本松", "福島松川ＰＡスマート", "福島西", "福島飯坂", "国見",
			"白石", "村田", "仙台南", "仙台宮城", "泉ＰＡスマート", "泉", "大和", "大衡", "三本木ＰＡスマート",
			"古川", "長者原ＳＡスマート", "築館", "若柳金成", "一関", "平泉前沢", "水沢", "北上金ヶ崎",
			"北上江釣子", "花巻南", "花巻", "紫波", "盛岡南", "盛岡", "滝沢", "西根", "松尾八幡平", "安代",
			"鹿角八幡平", "十和田", "小坂", "碇ヶ関", "大鰐弘前", "黒石", "浪岡", "青森", "新潟西",
			"黒埼ＰＡスマート", "巻潟東", "三条燕", "中之島見附", "西山", "柏崎", "米山", "柿崎",
			"大潟ＰＡスマート", "上越", "名立谷浜", "能生", "糸魚川", "親不知", "朝日", "新潟亀田", "新潟空港",
			"豊栄ＳＡスマート", "豊栄新潟東港", "聖籠新発田", "中条", "荒川胎内", "岩城", "秋田空港", "三郷",
			"三郷料金所スマート", "柏", "谷和原", "谷田部", "桜土浦", "土浦北", "千代田石岡", "石岡小美玉スマート",
			"岩間", "友部ＳＡスマート", "水戸", "水戸北スマート", "那珂", "東海ＰＡスマート", "日立南太田",
			"日立北", "高萩", "北茨城", "いわき勿来", "いわき湯本", "いわき中央", "いわき四倉", "広野",
			"常磐富岡", "浄法寺", "一戸", "九戸", "軽米", "南郷（八戸道）", "八戸", "八戸北", "青森中央",
			"青森東", "北上西", "湯田", "横手", "大曲", "西仙北ＳＡスマート", "協和", "秋田南", "秋田中央",
			"秋田北", "昭和男鹿半島", "五城目八郎潟", "琴丘森岳", "花巻空港", "東和", "宮城川崎", "笹谷",
			"関沢", "山形蔵王", "山形北", "寒河江", "寒河江ＳＡスマート", "西川", "月山", "いわき三和", "小野",
			"船引三春", "郡山東", "磐梯熱海", "猪苗代磐梯高原", "磐梯河東", "会津若松", "新鶴ＰＡスマート",
			"会津坂下", "西会津", "津川", "三川", "安田", "新津", "新潟中央", "山形上山", "山形中央",
			"天童", "東根", "都賀", "壬生", "宇都宮上三川", "真岡", "桜川筑西", "笠間西", "友部",
			"茨城町西", "茨城町東", "水戸南", "前橋南", "駒形（北関東道）", "波志江ＰＡスマート", "伊勢崎",
			"太田藪塚", "太田桐生", "練馬", "所沢", "三芳ＰＡスマート", "川越", "鶴ヶ島", "東松山", "嵐山小川",
			"花園", "本庄児玉", "高崎", "前橋", "駒寄ＰＡスマート", "渋川伊香保", "赤城", "昭和", "沼田",
			"月夜野", "水上", "湯沢（関越道）", "塩沢石打", "六日町", "大和ＰＡスマート", "小出", "堀之内",
			"越後川口", "小千谷", "長岡南越路スマート", "長岡", "藤岡", "吉井", "富岡", "下仁田", "松井田妙義",
			"碓氷軽井沢", "佐久平ＰＡスマート", "佐久", "小諸", "東部湯の丸", "上田菅平", "坂城",
			"長野（上信越道）", "須坂長野東", "小布施ＰＡスマート", "信州中野", "豊田飯山", "信濃町", "妙高高原",
			"中郷", "新井ＰＡスマート", "上越高田", "豊科", "麻績", "姨捨ＳＡスマート", "更埴", "東京",
			"東名川崎", "横浜青葉", "横浜町田", "厚木", "秦野中井", "大井松田", "御殿場", "裾野", "沼津",
			"富士", "富士川ＳＡスマート", "清水", "静岡", "焼津", "吉田", "相良牧之原", "菊川", "掛川",
			"袋井", "磐田", "遠州豊田ＰＡスマート", "浜松", "浜松西", "三ヶ日", "豊川", "音羽蒲郡", "岡崎",
			"豊田", "東名三好", "名古屋", "春日井", "小牧", "一宮", "岐阜羽島", "大垣", "関ヶ原", "彦根",
			"八日市", "伊勢関", "亀山", "亀山ＰＡスマート", "鈴鹿", "四日市", "四日市東", "桑名", "桑名東",
			"長島", "弥富", "蟹江", "名古屋西", "入善ＰＡスマート", "黒部", "魚津", "滑川", "立山",
			"流杉ＰＡスマート", "富山", "富山西", "小杉", "砺波", "小矢部", "金沢森本", "金沢東", "金沢西",
			"徳光ＰＡスマート", "美川", "小松", "安宅ＰＡスマート", "片山津", "加賀（北陸道）", "金津", "丸岡",
			"福井北", "福井", "鯖江", "武生", "南条ＳＡスマート", "今庄", "敦賀", "木之本", "長浜", "米原",
			"八王子", "相模湖東", "相模湖", "上野原", "大月", "都留", "河口湖", "勝沼", "一宮御坂",
			"甲府南", "甲府昭和", "双葉スマート", "韮崎", "須玉", "長坂（中央道）", "小淵沢", "諏訪南", "諏訪",
			"伊北", "伊那", "駒ヶ根", "松川", "飯田", "飯田山本", "園原", "中津川", "恵那", "瑞浪",
			"土岐", "多治見", "小牧東", "白根", "南アルプス", "増穂", "芸濃", "津", "久居", "一志嬉野",
			"松阪", "勢和多気", "玉城", "伊勢西", "伊勢", "大宮大台", "紀勢大内山", "岡谷", "塩尻",
			"塩尻北", "松本", "梓川ＳＡスマート", "一宮西", "尾西", "一宮木曽川", "岐阜各務原", "関", "美濃",
			"美並", "郡上八幡", "ぎふ大和", "白鳥", "高鷲", "ひるがの高原ＳＡスマート", "荘川", "飛騨清見",
			"白川郷", "五箇山", "福光", "豊田東", "豊田南", "豊明", "名古屋南", "大府", "湾岸弥富",
			"弥富木曽岬", "湾岸長島", "湾岸桑名", "みえ川越", "みえ朝日", "竜王", "栗東", "瀬田東（名神）",
			"瀬田西", "大津", "京都東", "京都南", "大山崎", "茨木", "吹田", "豊中", "尼崎", "西宮",
			"久御山淀", "草津田上", "信楽", "甲南", "甲賀土山", "神戸北", "三木東", "三木小野", "加古川北",
			"山陽姫路東", "山陽姫路西", "龍野", "龍野西", "赤穂", "備前", "和気", "山陽", "岡山",
			"吉備ＳＡスマート", "倉敷", "玉島", "鴨方", "笠岡", "福山東", "福山西", "尾道", "三原久井",
			"本郷（山陽道）", "河内", "高屋ＪＣＴ", "西条", "志和", "広島東", "広島", "五日市",
			"宮島ＳＡスマート", "岩国", "玖珂", "熊毛", "徳山東", "徳山西", "防府東", "防府西", "山口南",
			"宇部", "小野田", "埴生", "早島", "神戸西", "門司", "新門司", "小倉東", "小倉南", "八幡",
			"鞍手", "宮田スマート", "若宮（九州道）", "古賀", "福岡（九州道）", "須恵ＰＡスマート", "太宰府",
			"筑紫野", "久留米", "広川（九州道）", "八女", "みやま柳川", "南関", "菊水", "植木", "熊本",
			"益城熊本空港", "御船", "松橋", "八代", "人吉", "えびの", "栗野", "横川", "溝辺鹿児島空港",
			"加治木", "姶良", "薩摩吉田", "鹿児島北", "鹿児島", "徳島", "藍住", "土成", "脇町", "美馬",
			"吉野川ＳＡスマート", "井川池田", "三島川之江", "土居", "新居浜", "いよ西条", "いよ小松", "川内",
			"松山", "伊予", "内子五十崎", "大洲", "中国吹田", "中国豊中", "中国池田", "宝塚", "西宮北",
			"神戸三田", "吉川", "ひょうご東条", "滝野社", "加西", "福崎", "山崎（中国道）", "佐用", "作東",
			"美作", "津山", "院庄", "落合", "北房", "大佐ＳＡスマート", "新見", "東城", "庄原", "三次",
			"高田（中国道）", "千代田", "加計ＢＳスマート", "戸河内", "吉和", "六日市", "鹿野", "徳地", "山口",
			"小郡", "美祢東", "美祢", "美祢西", "小月", "下関", "門司港", "三田西", "丹南篠山口",
			"春日（舞鶴若狭道）", "福知山", "綾部", "舞鶴西", "舞鶴東", "大飯高浜", "小浜西", "播磨新宮",
			"久世", "湯原", "蒜山", "江府", "溝口", "米子", "有漢", "賀陽", "岡山総社", "広島西風新都",
			"広島北", "大朝", "瑞穂", "旭", "金城ＰＡスマート", "浜田", "苅田北九州空港", "大分米良",
			"大分宮河内", "臼杵", "津久見", "佐伯", "高鍋", "西都", "宮崎西", "清武", "末吉財部", "国分",
			"隼人東", "長崎", "長崎芒塚", "長崎多良見", "諫早", "大村", "東そのぎ", "嬉野", "武雄北方",
			"多久", "佐賀大和", "東脊振", "鳥栖", "筑後小郡", "甘木", "朝倉", "杷木", "日田", "天瀬高塚",
			"玖珠", "九重", "湯布院", "別府湾ＳＡスマート", "別府", "大分", "大分光吉", "速見", "小林",
			"高原", "都城", "田野", "宮崎", "高松東", "高松中央", "高松檀紙", "高松西", "府中湖ＰＡスマート",
			"善通寺", "三豊鳥坂", "さぬき豊中", "大野原", "鳴門", "板野", "引田", "白鳥大内", "津田東",
			"新宮", "大豊", "南国", "高知", "伊野", "土佐", "土佐ＰＡスマート", "須崎東", "坂出", "湯殿山",
			"庄内あさひ", "松江玉造", "宍道", "斐川", "出雲", "三刀屋木次", "大洲北只", "西予宇和", "三郷南",
			"外環三郷西", "草加", "川口東", "川口中央", "川口西", "外環浦和", "戸田東", "戸田西", "和光北",
			"和光", "大泉", "湾岸市川", "湾岸習志野", "湾岸千葉", "千葉北", "四街道", "佐倉", "富里",
			"成田", "大栄", "佐原香取", "潮来", "成田スマート", "新空港", "市原", "姉崎袖ヶ浦", "木更津北",
			"君津", "君津ＰＡスマート", "富津中央", "富津竹岡", "木更津南", "高井戸", "調布", "稲城",
			"国立府中", "大治南", "大治北", "甚目寺南", "甚目寺北", "清洲西", "清洲東（名古屋西方面）",
			"清洲東（名古屋方面）", "平田", "山田西", "山田東", "楠", "勝川", "松河戸", "小幡", "大森",
			"引山", "上社", "本郷（東名阪道）", "上社南", "植田", "鳴海", "有松", "摂津北", "摂津南",
			"門真", "大東鶴見", "東大阪北", "東大阪南", "八尾", "長原", "松原", "美原北", "美原南",
			"堺（阪和道）", "岸和田和泉", "藤井寺", "柏原", "香芝", "法隆寺", "郡山（西名阪道）", "天理",
			"貝塚（阪和道）", "泉南", "阪南", "和歌山北", "和歌山", "海南東", "海南", "下津", "有田",
			"御坊", "御坊南", "印南", "みなべ", "南紀田辺", "上之郷", "泉佐野", "りんくうＪＣＴ", "札幌",
			"江別西", "江別東", "岩見沢", "三笠", "美唄", "奈井江砂川", "滝川", "深川", "旭川鷹栖",
			"旭川北", "比布ＪＣＴ（旭川紋別道接続）", "和寒", "士別剣淵", "落部", "八雲", "国縫", "長万部",
			"豊浦", "虻田洞爺湖", "伊達", "室蘭", "登別室蘭", "登別東", "白老", "苫小牧西", "苫小牧東",
			"千歳", "恵庭", "輪厚ＰＡスマート", "北広島", "札幌南", "千歳東", "追分町", "夕張", "小樽",
			"朝里", "銭函", "手稲", "札幌西", "大谷地", "北郷", "新川", "札幌北", "伏古", "雁来",
			"十勝清水", "芽室", "帯広ＪＣＴ（帯広広尾道接続）", "音更帯広", "足寄", "許田", "宜野座", "金武",
			"屋嘉", "石川", "沖縄北", "沖縄南", "喜舎場ＢＳスマート", "北中城", "西原", "那覇", "鶴岡",
			"庄内空港", "酒田", "酒田みなと", "池田（道東道）", "本別", "トマム", "占冠", "下田百石", "八竜",
			"能代南", "十文字", "湯沢（湯沢横手）", "亘理", "岩沼", "仙台空港", "名取", "仙台東", "仙台港北",
			"利府しらかし台", "利府塩釜", "利府中", "市来", "美山", "水戸大洗", "ひたちなか", "白岡菖蒲",
			"桶川北本", "川島", "坂戸", "圏央鶴ヶ島", "狭山日高", "入間", "青梅", "日の出", "あきる野",
			"八王子西", "つくば中央", "つくば牛久", "牛久阿見", "阿見東", "稲敷", "東海", "名港潮見",
			"名港中央", "飛島", "関広見", "富加関", "美濃加茂", "可児御嵩", "土岐南多治見", "せと品野",
			"せと赤津", "豊田藤岡", "豊田勘八", "鞍ヶ池ＰＡスマート", "豊田松平", "瀬田東（京滋）", "石山",
			"南郷（京滋）", "笠取", "宇治東", "宇治西", "巨椋", "久御山", "巨椋池", "久御山南", "八幡東",
			"京田辺松井", "枚方東", "枚方学研", "交野北", "浜田東", "江津西", "江津", "廿日市", "大野",
			"大竹", "津田寒川", "志度", "さぬき三木", "いよ小松北", "東予丹原", "今治湯ノ浦", "八代南",
			"日奈久", "宇佐", "院内", "安心院", "大分農業文化公園", "日出", "隼人西", "穴川", "貝塚（京葉）",
			"松ヶ丘", "蘇我", "千葉東", "大宮", "高田（千葉東金）", "中野（千葉東金）", "山田（千葉東金）", "東金",
			"山武成東", "松尾横芝", "袖ヶ浦", "木更津金田", "篠崎", "市川", "原木", "船橋", "花輪", "幕張",
			"武石", "浮島", "羽曳野", "羽曳野東", "太子", "葛城", "新庄", "有田南", "湯浅",
			"広川（湯浅御坊）", "広川南", "川辺（湯浅御坊）", "保土ヶ谷", "港北", "都筑", "京浜川崎", "玉川",
			"常盤台", "峰岡", "星川", "藤塚", "新保土ヶ谷", "今井", "川上", "上矢部", "狩場", "別所",
			"日野", "港南台", "朝比奈", "逗子", "横須賀", "衣笠", "佐原", "浦賀", "馬堀海岸",
			"金沢自然公園", "堀口能見台", "並木", "西湘二宮", "橘", "国府津", "酒匂", "小田原", "早川（西湘）",
			"厚木西", "伊勢原", "平塚", "大磯", "山崎（箱根新道）", "須雲川", "芦ノ湖大観", "箱根峠", "西富士",
			"広見", "富士吉田", "山中湖", "須磨", "名谷", "高丸", "大蔵谷", "伊川谷", "玉津", "大久保",
			"明石西", "垂水ＪＣＴ", "学園南", "長坂（第二神明）", "米子西", "安来", "東出雲", "武雄南",
			"波佐見有田", "佐世保みなと", "佐世保中央", "古賀市布", "間の瀬", "川平", "西山町", "鹿児島西",
			"松元", "伊集院", "富津金谷", "鋸南保田", "鋸南富山", "富浦", "深川西", "沼ノ端西", "佐世保三川内",
			"佐世保大塔", "木更津東", "二宮（小田原厚木道路）", "小田原東", "荻窪", "小田原西", "石橋", "箱根口",
			"須走", "関西国際空港", "昭和町", "交野南", "寝屋川北", "寝屋川南", "第二京阪門真", "坂北", "坂南",
			"天応西", "天応東", "呉", "延岡南", "門川", "京橋（首都高速）", "新富町", "銀座", "汐留",
			"芝公園", "飯倉", "霞が関", "代官町", "北の丸", "神田橋", "呉服橋", "江戸橋", "宝町", "八重洲",
			"丸の内（首都高速）", "東銀座", "新京橋", "西銀座", "土橋", "新橋", "新板橋", "滝野川", "王子北",
			"扇大橋", "千住新橋", "小菅", "四つ木", "平井大橋", "船堀橋", "清新町", "本町（首都高速）", "上野",
			"入谷", "芝浦", "勝島", "鈴ヶ森", "平和島", "空港西", "羽田", "天現寺", "目黒", "荏原",
			"戸越", "高樹町", "渋谷", "池尻", "三軒茶屋", "用賀", "外苑", "代々木", "新宿", "初台",
			"幡ヶ谷", "永福", "一ツ橋", "西神田", "飯田橋", "早稲田", "護国寺", "東池袋", "北池袋",
			"板橋本町", "中台", "高島平", "戸田南", "戸田", "箱崎（首都高速）", "浜町", "清洲橋",
			"駒形（首都高速）", "向島（首都高速）", "堤通", "加平", "八潮南", "八潮", "錦糸町", "小松川",
			"一之江", "福住", "木場", "塩浜", "枝川", "台場", "鹿浜橋", "東領家", "加賀（首都高速）",
			"足立入谷", "新郷", "安行", "新井宿", "湾岸環八", "空港中央", "大井南", "大井", "臨海副都心",
			"有明", "新木場", "葛西", "舞浜", "浦安", "千鳥町", "富ヶ谷", "初台南", "中野長者橋", "西池袋",
			"高松", "豊洲", "大師", "浜川崎", "浅田", "汐入", "生麦", "守屋町", "子安", "東神奈川",
			"横浜駅東口", "みなとみらい", "横浜公園", "横浜駅西口", "三ツ沢", "新山下", "石川町", "阪東橋",
			"花之木", "永田", "殿町", "幸浦", "杉田", "磯子", "三渓園", "本牧ふ頭", "大黒ふ頭", "東扇島",
			"山下町", "与野", "新都心西", "新都心", "さいたま見沼", "浦和南", "浦和北", "北浜", "高麗橋",
			"本町（阪神高速）", "長堀", "道頓堀", "夕陽丘", "えびす町", "なんば", "湊町", "四ツ橋", "信濃橋",
			"土佐堀", "堂島", "高津", "西長堀", "中之島西", "海老江", "姫島", "大和田", "尼崎東", "尼崎西",
			"武庫川", "出入橋", "中之島", "梅田", "福島", "塚本", "加島", "豊中南（南行き）",
			"豊中南（北行き）", "豊中北", "大阪空港", "池田（阪神高速）", "神田", "川西小花", "池田木部", "南森町",
			"扇町", "長柄", "都島", "城北", "森小路", "守口", "法円坂", "森之宮", "高井田", "長田",
			"東大阪荒本（東行き出口）", "東大阪荒本", "中野（阪神高速）", "水走", "天王寺", "阿倍野", "文の里",
			"駒川", "平野", "喜連瓜破", "三宅", "大堀", "汐見橋", "芦原", "津守", "玉出", "住之江",
			"堺（阪神高速）", "阿波座", "九条", "本田", "波除", "北津守", "大正東", "大正西", "弁天町",
			"安治川", "天保山", "南港北", "南港中", "南港南", "三宝", "大浜", "出島（阪神高速）", "石津",
			"浜寺", "高石", "助松", "助松ＪＣＴ", "北港西", "中島", "尼崎東海岸", "尼崎末広", "鳴尾浜",
			"ユニバーサルシティ", "島屋", "島屋東", "芦屋", "深江", "魚崎", "摩耶", "生田川（阪神高速）",
			"京橋（阪神高速）", "柳原", "湊川", "若宮（阪神高速）", "月見山", "甲子園浜", "西宮浜", "南芦屋浜",
			"深江浜", "魚崎浜", "六甲アイランド北", "住吉浜", "永井谷", "前開", "布施畑西", "布施畑",
			"布施畑東", "しあわせの村", "藍那", "箕谷", "からと西", "からと東", "有馬口", "西宮山口南",
			"西宮山口東", "五社", "柳谷", "白川南", "妙法寺", "神戸長田", "泉大津", "岸和田北", "岸和田南",
			"貝塚（阪神高速）", "泉佐野北", "泉佐野南", "山科", "鴨川東", "鴨川西", "上鳥羽", "城南宮北",
			"城南宮南", "伏見", "鳴門北", "淡路島南", "西淡三原", "洲本", "津名一宮", "北淡", "東浦",
			"淡路", "水島", "児島", "与島ＰＡ", "坂出北", "西瀬戸尾道", "向島（西瀬戸道）", "因島北", "因島南",
			"生口島北", "生口島南", "大三島", "伯方島", "大島北", "大島南", "今治北", "今治", "東新町",
			"東別院", "錦橋", "名駅", "丸の内（名古屋高速）", "東片端", "黒川", "白川（名古屋高速）", "吹上東",
			"吹上西", "春岡", "四谷", "高針", "高辻", "堀田", "呼続", "笠寺", "星崎", "大高", "黄金",
			"烏森", "千音寺", "豊山南", "豊山北", "小牧南", "堀の内", "小牧北", "春日（名古屋高速）", "西春",
			"一宮西春", "一宮南", "一宮東", "一宮中", "明道町", "庄内通", "鳥見町", "清須", "六番北",
			"香椎東", "香椎", "香椎浜", "名島", "箱崎（福岡高速）", "東浜", "築港", "天神北", "西公園",
			"百道", "愛宕", "姪浜", "石丸", "福重", "呉服町", "千代", "博多駅東", "榎田", "半道橋",
			"月隈", "金の隈", "大野城", "水城", "空港通", "貝塚（福岡高速）", "松島", "多の津", "粕屋",
			"西月隈", "板付", "野多目", "堤", "野芥", "福重（月隈方向）", "長野（北九州高速）", "横代", "若園",
			"北方", "篠崎南", "紫川", "篠崎北", "大手町", "勝山", "下到津", "小倉駅北", "日明", "西港",
			"戸畑", "若戸", "春日（北九州高速）", "大里", "富野", "足立", "山路", "大谷", "黒崎", "小嶺",
			"馬場山", "金剛", "枝光", "東田", "間所", "温品", "馬木", "福田", "矢賀", "府中", "大州",
			"東雲", "仁保", "宇品", "出島（広島高速）", "吉島", "松島海岸", "松島大郷", "松島北",
			"山田（仙台南部）", "長町", "今泉", "京丹波わち", "綾部安国寺", "舞鶴大江", "宮津天橋立", "姫路ＪＣＴ",
			"花田", "豊富", "砥堀", "船津", "福崎南", "福崎北", "市川南", "市川北", "神崎南", "神崎北",
			"生野", "生野北第一", "生野北第二", "朝来", "和田山", "嘉川", "由良", "阿知須", "宇部東",
			"宇部南", "日立中央", "流山", "稲城大橋出入口", "長久手", "美原", "美原東", "三沢十和田下田",
			"六戸町終点", "小矢部東", "福岡（能越道）", "高岡", "高岡北", "常陸那珂港", "徳次郎", "大沢（日光道）",
			"今市", "日光", "清滝", "横芝光", "力石", "枝下", "西広瀬", "中山（猿投グリーン）", "猿投東",
			"猿投", "加納", "八草東", "八草", "大府西", "大府東海", "東浦知多", "阿久比", "半田中央",
			"半田", "武豊", "美浜", "南知多", "豊丘", "常滑", "りんくう", "セントレア東", "西石切", "壱分",
			"小瀬", "中町", "宝来", "平井", "太平寺", "菱木", "取石", "唐櫃", "吉尾", "鶴甲（高羽）",
			"唐櫃南", "国道２号", "二宮（新神戸トンネル）", "神若", "新神戸駅", "大沢（六甲北）", "長尾",
			"生田川（山麓バイパス）", "三宮", "天王谷", "若戸大橋口", "拾六町", "今宿", "周船寺", "前原",
			"長崎市新地町", "藤原ＪＣＴ", "杵築", "安岐", "本郷北方", "田吉", "赤江", "宮崎市郡司分",
			"山田（指宿スカイライン）", "中山（指宿スカイライン）", "谷山", "錫山", "川辺（指宿スカイライン）", "知覧",
			"頴娃", "葉山町長柄", "横須賀市汐入町", "横須賀市林５丁目", "早川（ＴＯＹＯ　ＴＩＲＥＳターンパイク）",
			"大観山", "女の都", "長与", "時津町元村郷", "海田大橋出入口", "矢吹中央", "玉川（あぶくま）", "朝熊",
			"二見ヶ浦", "鳥羽", "遠阪", "山東", "山元", "足利", "佐野田沼", "海老名", "茨城空港北",
			"佐用ＪＣＴ（鳥取道接続）", "尾道ＪＣＴ（尾道道接続）", "日向", "佐久小諸ＪＣＴ", "野田市終点", "鳴瀬奥松島",
			"矢本", "石巻港", "石巻河南", "夢野", "鵯", "車", "南風原北", "南風原南", "浦幌"

	};
            foreach (var name in icNames)
                ICs.Add(name);
            this.ICS.ItemsSource = ICs;
            this.ICE.ItemsSource = ICs;
            this.ICS.ItemFilter += SearchCountry;
            this.ICE.ItemFilter += SearchCountry;

        }

        //全局模糊搜索
        bool SearchCountry(string search, object value)
        {
            if (value != null)
            {
                //如果包含了搜索的字符串则返回true
                if (value.ToString().ToLower().IndexOf(search) >= 0)
                    return true;
            }
            // 如果不匹配 返回false
            return false;
        }

        private void btnSearch_Click(object sender, RoutedEventArgs e)
        {
            if (this.ICS.Text.Length == 0 || this.ICE.Text.Length == 0)
            {
                return;
            }


            string target = "/result.xaml";
            target += string.Format("?f={0}&t={1}&c={2}", new string[] { this.ICS.Text, this.ICE.Text, arr[this.listPicker1.SelectedIndex] });
            this.NavigationService.Navigate(new Uri(target, UriKind.Relative));
        }

        private void btnHelp_Click(object sender, RoutedEventArgs e)
        {
            string target = "/help.xaml";
            this.NavigationService.Navigate(new Uri(target, UriKind.Relative));
        }

        private void btnHist_Click(object sender, RoutedEventArgs e)
        {
            string target = "/hist.xaml";
            this.NavigationService.Navigate(new Uri(target, UriKind.Relative));
        }

        protected override void OnNavigatedTo(System.Windows.Navigation.NavigationEventArgs e)
        {
            string value = string.Empty;
            IDictionary<string, string> queryString = this.NavigationContext.QueryString;
            canDrop = false;
            queryString.TryGetValue("f", out value);
            if (value != null)
            {
              
               this.ICS.Text = value;
              //
            }

            queryString.TryGetValue("t", out value);
            if (value != null)
            {
                 this.ICE.Text = value;
             }


            this.btnSearch.IsTabStop = true;
            this.btnSearch.Focus();
         

        }

        private void ICS_DropDownOpening(object sender, RoutedPropertyChangingEventArgs<bool> e)
        { if(!canDrop)
            e.Cancel = true;
        }

        private void ICE_DropDownOpening(object sender, RoutedPropertyChangingEventArgs<bool> e)
        {
            if (!canDrop)
                e.Cancel = true;
        }

        private void ICS_GotFocus(object sender, RoutedEventArgs e)
        {
            canDrop = true;
        }
    }
}